
## Plan Result




<pre><code>Plan: 6 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0]
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription
* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.finalsa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-powerplatform-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-powerplatform-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_smoketest_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-smoketest-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_smoketest_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "apim-sub-smoketest-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/products/pre-api"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "PRE Power Platform subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "pre-api smoke test subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":692,"Program":"tfcmt","SHA1":"","Vars":{}} -->